Documents/усд_ВходящийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>усд_ВходящийДокумент</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ИсточникиИВладельцыДокументов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ИсточникиИВладельцыДокументов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/усд_ВходящийДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.ДокументПриСозданииНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.УстановитьЗаголовокФормыДокумента("", Объект.Ссылка, ЭтотОбъект);
	
	// обработка доступности формы на основании данных согласования документов
	усд_УправлениеСогласованиемДокументов.ДоступностьРедактированияДокумента(ЭтотОбъект,Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.ДокументПриЧтенииНаСервере(ЭтотОбъект,ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.УстановитьЗаголовокФормыДокумента("", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	общ_ОбщегоНазначенияКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ПозицияКлассификатораПриИзменении(Элемент)
	Если мПозицияКлассификатора<>Объект.ПозицияКлассификатора Тогда
		Заголовок = ?(Объект.ПозицияКлассификатора.Пустая(),"",Объект.ПозицияКлассификатора);
		Объект.ВнутреннийНомер = "";
		мПозицияКлассификатора=Объект.ПозицияКлассификатора;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <>



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Генерировать(Команда)
	Объект.ВнутреннийНомер = ГенерироватьНомер(Объект.Ссылка,Объект.ПозицияКлассификатора);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если НЕ (ЗначениеЗаполнено(Параметры.ЗначениеКопирования) ИЛИ ЗначениеЗаполнено(Параметры.Основание)) Тогда
			// по умолчанию при распределении учитываются все возможные показатели

		КонецЕсли;
		
	КонецЕсли;
	
	НадписьПринадлежностьДокумента = "Принадлежность документа";
	НадписьРеквизитыВходящегоДокумента = "Реквизиты входящего документа";
	мПозицияКлассификатора = Объект.ПозицияКлассификатора;
	Заголовок = ?(Объект.ПозицияКлассификатора.Пустая(),"",Объект.ПозицияКлассификатора);
	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ДлинаВнутреннегоНомера") <> 0 Тогда
		КлассификаторСтроки = Новый КвалификаторыСтроки(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ДлинаВнутреннегоНомера"),ДопустимаяДлина.Переменная);
		Типы = Новый Массив;
		Типы.Добавить(Тип("Строка"));
		Описание = Новый ОписаниеТипов(Типы,,КлассификаторСтроки);
	    Элементы.ВнутреннийНомер.ОграничениеТипа = Описание;
	КонецЕсли;
	
КонецПроцедуры 

//Процедура ГенерироватьНажатие
//
&НаСервереБезКонтекста
Функция ГенерироватьНомер(Ссылка, ПозицияКлассификатора)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.УстановитьПараметр("ПозицияКлассификатора",	ПозицияКлассификатора);
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВходящийДокумент.ВнутреннийНомер) КАК ВнутреннийНомер
	               |ИЗ
	               |	Документ.усд_ВходящийДокумент КАК ВходящийДокумент
	               |ГДЕ
	               |	ВходящийДокумент.Ссылка <> &Ссылка
	               |	И ВходящийДокумент.ПозицияКлассификатора = &ПозицияКлассификатора";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПоследнийНомер = Выборка.ВнутреннийНомер;
	Иначе
		ПоследнийНомер = "0";
	КонецЕсли;
	Если ПоследнийНомер = NULL ИЛИ ПоследнийНомер="" Тогда
		ПоследнийНомер = "0";
	КонецЕсли;
	Если Строка(Число(ПоследнийНомер)) = СокрЛП(ПоследнийНомер) Тогда
		ПоследнийНомер = Строка(Число(ПоследнийНомер)+1);
	Иначе
		ПоследняяЦифра = Прав(ПоследнийНомер,1);
		Если Строка(Число(ПоследняяЦифра))=ПоследняяЦифра Тогда
			мЧисло = Число(ПоследняяЦифра)+1;
			ПоследнийНомер = Лев(ПоследнийНомер,СтрДлина(ПоследнийНомер)-1);
		Иначе
			мЧисло = 1;
		КонецЕсли;
		ПоследнийНомер = ПоследнийНомер+Строка(мЧисло);
	КонецЕсли;
	Длина = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ДлинаВнутреннегоНомера");
	Если Длина = 0 Тогда
		Длина = 11;
	КонецЕсли;
	Пока СтрДлина(ПоследнийНомер)<Длина Цикл
		ПоследнийНомер = "0"+ПоследнийНомер;
	КонецЦикла;
	Возврат ПоследнийНомер;
	
КонецФункции //ГенерироватьНажатие
